# 1.2 Lists

In [2]:
import numpy as np
import pandas as pd
f_list = [np.nan , np.nan, "Austria", "Germany", np.nan, "Pakistan", "np.nan", np.nan ]
text1 = ['My', 'teacher', 'assistant', 'is', 'so', 'boring.']
p2_list = [ 2 , 3, 4, 5 ]
values1 = [ 86, 86, 85, 85, 85, 83, 23, 0, 84, 1 ]
last_and_name = [ "CORNEJO SANCHEZ, CHRISTIAN SANTOS", "ORELLANA QUISPE, CRISTIAN NASSER", "MORALES CHOQUEHUANCA, ANGELICA KARINA", "GUIMARAY RIBEYRO, JOSE ROBERTO", "CAMACHO GAVIDIA, ABEL FERNANDO", "TINTAYA ORIHUELA, MEIR ALVARO", "CHAVEZ MARTINEZ, JOSELIN ALEXANDRA", "FIGUEROA MURO, LEONEL ARTURO", "GOMEZ CRIBILLERO, JOSE FELIPE", "PALOMINO SEGUÍN, AFRANIA", "LUZON CUEVA, BIANCA MARIETTE", "SUAÑA ZEGARRA, ADRIAN ANDRE", "SOTO POMACHAGUA, DORKAS YOMIRA JHERMY", "FIORENTINO MARTINEZ, LADY ALY", "LAMA MAVILA, HECTOR ANDRE", "MEZA HINOJO, GUSTAVO", "LOZADA MURILLO, PERSEO MARCELO", "ZAMBRANO JIMENEZ, MIGUEL ALONZO", "JACOBS LUQUE, NICOLAS", "VIDAL VIDAL, ROCIO GABRIELA", "TORRES ANICAMA, JANE CAMILA", "LOPEZ ESTRADA, MARIA ELISA", "BOYCO ORAMS, ALEJANDRO", "DIAZ BERROSPI, KARLINE ROSMELI", "RIEGA ESCALANTE, STEPHY ROSARIO", "LEVANO TORRES, VALERIA CECILIA", "ESQUIVES BRAVO, SEBASTIAN RENATO", "PEREZ GONZALES, JUAN CARLOS", "OTERO MAGUIÑA, MARIANA", "CLAVO CAMPOS, ANDREA BRIZETH", "AGUILAR GARCIA, ERICK JOSUE", "CALDAS VELASQUEZ, JOSUE DANIEL", "SALAS NUÑEZ BORJA, FABIO MANUEL", "PIZARRO VILLANES, FERNANDA NICOLLE", "QUILLATUPA MORALES, ANGELA ADELINA", "HUANCAYA IDONE, CESAR DANTE", "CALVO PORTOCARRERO, GABRIELA ISABEL", "IBAÑEZ ABANTO, ANGEL MAURICIO", "MELÉNDEZ APONTE, JUAN DIEGO", "CRISTIAN SERRANO, ARONE", "HINOJOSA CAHUANA, PERCY ALBERTH", "ANGLAS GARCÍA, KEVIN ARTURO", "ALDAVE ACOSTA, CESAR ERNESTO", "NÚÑEZ HUAMÁN, CÉSAR AGUSTO", "OBREGON HUAMAN, DIANA EDITH", "SOTO PACHERRES, RODRIGO FRANCO", "INGARUCA RIVERA, GRETTEL ALEXANDRA", "ROJAS HUAMAN, ROSA ANGELA", "NEYRA SALAS, DANTE OMAR", "HUERTA ESPINOZA, YAJAIRA ALEXANDRA", "HUANCA MARTINEZ, JORGE ALBERTO", "FLORES CADILLO, ALEXIS" ]
emails = ["cscornejo@pucp.edu.pe", "orellana.cn@pucp.edu.pe", "karina.morales@pucp.edu.pe", "a20083223@pucp.pe", "abel.camacho@pucp.pe", "mtintaya@pucp.edu.pe", "joselin.chavez@pucp.edu.pe", "a20105737@pucp.pe", "jfgomezc@pucp.pe", "afrania.palomino@pucp.pe", "luzon.bianca@pucp.pe", "adrian.suanaz@pucp.pe", "soto.y@pucp.edu.pe", "a20132766@pucp.pe", "andre.lama@pucp.edu.pe", "gustavo.meza@pucp.edu.pe", "pmlozada@pucp.edu.pe", "m.zambranoj@pucp.edu.pe", "nicolas.jacobs@pucp.edu.pe", "gvidal@pucp.edu.pe", "jane.torres@pucp.edu.pe", "m.lopez@pucp.edu.pe", "alejandro.boyco@pucp.edu.pe", "a20167070@pucp.edu.pe", "riega.stephy@pucp.edu.pe", "vlevanot@pucp.edu.pe", "sesquives@pucp.edu.pe", "perez.juanc@pucp.edu.pe", "mariana.otero@pucp.edu.pe", "aclavo@pucp.edu.pe", "a20182474@pucp.edu.pe", "josue.caldas@pucp.edu.pe", "fabio.salas@pucp.edu.pe", "fernanda.pizarro@pucp.edu.pe", "aquillatupa@pucp.pe", "", "", "", "", "", "f0873079@pucp.edu.pe", "", "", "", "", "", "", "", "", "", "", "flores.alexis@pucp.edu.pe", ]

In [3]:
#1.1 Show the indices of the np.nan values in the f_list list. We want to see this output: The indices 0, 1, 4, 7 have np.nan values.
  #Hint: Use print function and f-strings to insert the indices values.
print(f_list) #The 6th element is the one who in 'np.man', between ''
el = f_list[6]
el2 = "0,1,4,7"
print(f"The indices {el2} have {el} values")

[nan, nan, 'Austria', 'Germany', nan, 'Pakistan', 'np.nan', nan]
The indices 0,1,4,7 have np.nan values

In [4]:
#1.2 Replicate 4 times the values of the list p2_list. We expect an ouput like this: [ 2 , 3, 4, 5, 2 , 3, 4, 5, 2 , 3, 4, 5, 2 , 3, 4, 5].
  #Hint: Use multiplication function in lists and see the output.

print(p2_list*4)

[2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5]

In [5]:
#1.3 Print the length of f_list. Hint: Length function

print(len(f_list))

8

In [6]:
#1.4 Print My teacher assistant is so boring. using text1 list. Hint: Use the join function

print(" ".join(text1))

My teacher assistant is so boring.

In [7]:
#1.5 Print My TA is so boring, but is very funny. using text1 list.Hint: Use the join function, and extend method.
text2 = ["My","TA", "is", "so", "boring,"]
text3 = ["but", "is", "very", "funny."]
text4 = text2 + text3
print(" ".join(text4))

My TA is so boring, but is very funny.

In [8]:
#1.6 Print
  #The max value of values1 is 86 and is located in the 0 index.
  #The min value of values1 is 0 and is located in the 7 index.
  #Hint: Use the f-string, min, and max functions.

print("The max value of values1 is {0} and is located in the {1} index.".format(max(values1),values1.index(max(values1))))
print("The min value of values1 is {0} and is located in the {1} index.".format(min(values1),values1.index(min(values1))))

The max value of values1 is 86 and is located in the 0 index.
The min value of values1 is 0 and is located in the 7 index.

In [9]:
#1.7 Get two lists: `names` and `last_names` using `last_and_name` list. **Hint: Use `map` and `split`.**

last_names, names = list(map(lambda x: x.split(', ')[0], last_and_name)), list(map(lambda x: x.split(', ')[1], last_and_name))
print(last_names)
print(names)

['CORNEJO SANCHEZ', 'ORELLANA QUISPE', 'MORALES CHOQUEHUANCA', 'GUIMARAY RIBEYRO', 'CAMACHO GAVIDIA', 'TINTAYA ORIHUELA', 'CHAVEZ MARTINEZ', 'FIGUEROA MURO', 'GOMEZ CRIBILLERO', 'PALOMINO SEGUÍN', 'LUZON CUEVA', 'SUAÑA ZEGARRA', 'SOTO POMACHAGUA', 'FIORENTINO MARTINEZ', 'LAMA MAVILA', 'MEZA HINOJO', 'LOZADA MURILLO', 'ZAMBRANO JIMENEZ', 'JACOBS LUQUE', 'VIDAL VIDAL', 'TORRES ANICAMA', 'LOPEZ ESTRADA', 'BOYCO ORAMS', 'DIAZ BERROSPI', 'RIEGA ESCALANTE', 'LEVANO TORRES', 'ESQUIVES BRAVO', 'PEREZ GONZALES', 'OTERO MAGUIÑA', 'CLAVO CAMPOS', 'AGUILAR GARCIA', 'CALDAS VELASQUEZ', 'SALAS NUÑEZ BORJA', 'PIZARRO VILLANES', 'QUILLATUPA MORALES', 'HUANCAYA IDONE', 'CALVO PORTOCARRERO', 'IBAÑEZ ABANTO', 'MELÉNDEZ APONTE', 'CRISTIAN SERRANO', 'HINOJOSA CAHUANA', 'ANGLAS GARCÍA', 'ALDAVE ACOSTA', 'NÚÑEZ HUAMÁN', 'OBREGON HUAMAN', 'SOTO PACHERRES', 'INGARUCA RIVERA', 'ROJAS HUAMAN', 'NEYRA SALAS', 'HUERTA ESPINOZA', 'HUANCA MARTINEZ', 'FLORES CADILLO']
['CHRISTIAN SANTOS', 'CRISTIAN NASSER', 'ANGELICA KARINA', 'JOSE ROBERTO', 'ABEL FERNANDO', 'MEIR ALVARO', 'JOSELIN ALEXANDRA', 'LEONEL ARTURO', 'JOSE FELIPE', 'AFRANIA', 'BIANCA MARIETTE', 'ADRIAN ANDRE', 'DORKAS YOMIRA JHERMY', 'LADY ALY', 'HECTOR ANDRE', 'GUSTAVO', 'PERSEO MARCELO', 'MIGUEL ALONZO', 'NICOLAS', 'ROCIO GABRIELA', 'JANE CAMILA', 'MARIA ELISA', 'ALEJANDRO', 'KARLINE ROSMELI', 'STEPHY ROSARIO', 'VALERIA CECILIA', 'SEBASTIAN RENATO', 'JUAN CARLOS', 'MARIANA', 'ANDREA BRIZETH', 'ERICK JOSUE', 'JOSUE DANIEL', 'FABIO MANUEL', 'FERNANDA NICOLLE', 'ANGELA ADELINA', 'CESAR DANTE', 'GABRIELA ISABEL', 'ANGEL MAURICIO', 'JUAN DIEGO', 'ARONE', 'PERCY ALBERTH', 'KEVIN ARTURO', 'CESAR ERNESTO', 'CÉSAR AGUSTO', 'DIANA EDITH', 'RODRIGO FRANCO', 'GRETTEL ALEXANDRA', 'ROSA ANGELA', 'DANTE OMAR', 'YAJAIRA ALEXANDRA', 'JORGE ALBERTO', 'ALEXIS']

In [10]:
#1.8 Give only the last names of students who do not have email. Use the `emails` and `last_names` listt. **Hint: Use `map` and `split`.**

last_names_no_email = list(map(lambda x: emails[last_names.index(x)] == "", last_names))
print(last_names_no_email)

[False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, True, True, True, True, True, False, True, True, True, True, True, True, True, True, True, True, False]

# 1.3 Strings

In [11]:
str1 = 'I am                            too                                                        old'
emails = ["cscornejo@pucp.edu.pe", "orellana.cn@pucp.edu.pe", "karina.morales@pucp.edu.pe", "a20083223@pucp.pe", "abel.camacho@pucp.pe", "mtintaya@pucp.edu.pe", "joselin.chavez@pucp.edu.pe", "a20105737@pucp.pe", "jfgomezc@pucp.pe", "afrania.palomino@pucp.pe", "luzon.bianca@pucp.pe", "adrian.suanaz@pucp.pe", "soto.y@pucp.edu.pe", "a20132766@pucp.pe", "andre.lama@pucp.edu.pe", "gustavo.meza@pucp.edu.pe", "pmlozada@pucp.edu.pe", "m.zambranoj@pucp.edu.pe", "nicolas.jacobs@pucp.edu.pe", "gvidal@pucp.edu.pe", "jane.torres@pucp.edu.pe", "m.lopez@pucp.edu.pe", "alejandro.boyco@pucp.edu.pe", "a20167070@pucp.edu.pe", "riega.stephy@pucp.edu.pe", "vlevanot@pucp.edu.pe", "sesquives@pucp.edu.pe", "perez.juanc@pucp.edu.pe", "mariana.otero@pucp.edu.pe", "aclavo@pucp.edu.pe", "a20182474@pucp.edu.pe", "josue.caldas@pucp.edu.pe", "fabio.salas@pucp.edu.pe", "fernanda.pizarro@pucp.edu.pe", "aquillatupa@pucp.pe"]

In [12]:
#2.1 Drop the duplicated blank spaces in str1. Do not use the regular expresions. Do not use the code shown in class.
  #Explain your steps.Hint: Use split method and join function.

print(" ".join(str1.split()))
  # We use split to get an array with the words and then join to get the sentence without blank spaces

I am too old

In [13]:
#2.2 Get the number of letters in the string .Hint: Use lenfunction.

print(len("".join(str1.split())))

9

In [14]:
#2.3 Get the number of blank spaces (all of them) in the string .Hint: Use lenfunction.

print(len(list(filter(lambda x: x == ' ', str1))))

85

In [15]:
#2.4 Get the position of @ in each string in the emails list. Hint: Use mapfunction and find method.
print(list(map(lambda email: email.find('@'),emails)))

[9, 11, 14, 9, 12, 8, 14, 9, 8, 16, 12, 13, 6, 9, 10, 12, 8, 11, 14, 6, 11, 7, 15, 9, 12, 8, 9, 11, 13, 6, 9, 12, 11, 16, 11]

In [16]:
#2.5 Identifies if exists .edu. in each string in the emails list. Get a list of Booleans. Hint: Use mapfunction and find method.
def new(emails):
    if emails.find(".edu") == -1:
        print(False)
    if emails.find(".edu") > -1:
        print(True)
edu = list(map(new,emails))
print(new)

True
True
True
False
False
True
True
False
False
False
False
False
True
False
True
True
True
True
True
True
True
True
True
True
True
True
True
True
True
True
True
True
True
True
False
<function new at 0x000001985C7EF6A0>

In [17]:
#2.6 Get all the strings before the first dot .in each string in the emails list. Identifies how many of them has @. Hint: Use mapfunction and find method.
new = list(map(lambda item: item.split('.')[0],emails))
new2 = list(map(lambda item:item[item.find('@')] =='@', new))
print(new2)
print(new2.count(True))

[True, False, False, True, False, True, False, True, True, False, False, False, False, True, False, False, True, False, False, True, False, False, False, True, False, True, True, False, False, True, True, False, False, False, True]
14

# 1.4 Pandas

In [1]:
#1.
import pandas as pd
#Reading and loading the data
data=pd.read_csv("https://raw.githubusercontent.com/datasets/finance-vix/main/data/vix-daily.csv")

In [2]:
#2.a
#we used head() in order to display the first five rows of the Dataframe
data.head(5)

         DATE   OPEN   HIGH    LOW  CLOSE
0  01/02/1990  17.24  17.24  17.24  17.24
1  01/03/1990  18.19  18.19  18.19  18.19
2  01/04/1990  19.22  19.22  19.22  19.22
3  01/05/1990  20.11  20.11  20.11  20.11
4  01/08/1990  20.26  20.26  20.26  20.26

In [3]:
#2.b
#We used .describe() to generate descriptive statistics.
#These descriptive statistics include a summary of the central tendency and dispersion
data.describe()

              OPEN         HIGH          LOW        CLOSE
count  8576.000000  8576.000000  8576.000000  8576.000000
mean     19.667087    20.475051    18.915540    19.581101
std       7.979316     8.440179     7.470016     7.906388
min       9.010000     9.310000     8.560000     9.140000
25%      13.937500    14.540000    13.407500    13.880000
50%      17.795000    18.470000    17.220000    17.760000
75%      23.102500    23.960000    22.322500    22.990000
max      82.690000    89.530000    72.760000    82.690000

In [4]:
#3.a
#we used pd.cut() and 'bins' argument to divide the values of CLOSE variable in 3 intervals:
# [0,20] the first interval:Low; [20,30] the second interval:Medium; [30,100] the third interval: High
#finally with the argument 'labels' we added labels to them.
data["Level"]=pd.cut(data["CLOSE"], bins=[0,20,30,100], labels=["Low", "Medium", "High"])
#checking with the first 10 observations
data.head(10)

         DATE   OPEN   HIGH    LOW  CLOSE   Level
0  01/02/1990  17.24  17.24  17.24  17.24     Low
1  01/03/1990  18.19  18.19  18.19  18.19     Low
2  01/04/1990  19.22  19.22  19.22  19.22     Low
3  01/05/1990  20.11  20.11  20.11  20.11  Medium
4  01/08/1990  20.26  20.26  20.26  20.26  Medium
5  01/09/1990  22.20  22.20  22.20  22.20  Medium
6  01/10/1990  22.44  22.44  22.44  22.44  Medium
7  01/11/1990  20.05  20.05  20.05  20.05  Medium
8  01/12/1990  24.64  24.64  24.64  24.64  Medium
9  01/15/1990  26.34  26.34  26.34  26.34  Medium

In [5]:
#3.b
#We used .to_datetime to convert dates into pandas date format. Then with .dt.year we extract the year
pd.to_datetime(data["DATE"]).dt.year
#Creating a new column
data["Year"]=pd.to_datetime(data["DATE"]).dt.year
#checking with the first 10 observations
data.head(10)

         DATE   OPEN   HIGH    LOW  CLOSE   Level  Year
0  01/02/1990  17.24  17.24  17.24  17.24     Low  1990
1  01/03/1990  18.19  18.19  18.19  18.19     Low  1990
2  01/04/1990  19.22  19.22  19.22  19.22     Low  1990
3  01/05/1990  20.11  20.11  20.11  20.11  Medium  1990
4  01/08/1990  20.26  20.26  20.26  20.26  Medium  1990
5  01/09/1990  22.20  22.20  22.20  22.20  Medium  1990
6  01/10/1990  22.44  22.44  22.44  22.44  Medium  1990
7  01/11/1990  20.05  20.05  20.05  20.05  Medium  1990
8  01/12/1990  24.64  24.64  24.64  24.64  Medium  1990
9  01/15/1990  26.34  26.34  26.34  26.34  Medium  1990

In [6]:
#4.a
#we created a new dataframe
mis_datos= {'DATE':['19/08/2002'], 'OPEN':[20.26], 'HIGH':[17.24], 'LOW':[22.44], 'CLOSE':[24.34], 'Level':['Medium'], 'Year':[2002]}
my_df=pd.DataFrame(mis_datos)
#adding it to the given dataframe
pd.concat([data, my_df])

            DATE   OPEN   HIGH    LOW  CLOSE   Level  Year
0     01/02/1990  17.24  17.24  17.24  17.24     Low  1990
1     01/03/1990  18.19  18.19  18.19  18.19     Low  1990
2     01/04/1990  19.22  19.22  19.22  19.22     Low  1990
3     01/05/1990  20.11  20.11  20.11  20.11  Medium  1990
4     01/08/1990  20.26  20.26  20.26  20.26  Medium  1990
...          ...    ...    ...    ...    ...     ...   ...
8572  12/29/2023  12.55  13.19  12.36  12.45     Low  2023
8573  01/02/2024  13.22  14.23  13.10  13.20     Low  2024
8574  01/03/2024  13.35  14.22  13.33  14.04     Low  2024
8575  01/04/2024  13.93  14.20  13.64  14.13     Low  2024
0     19/08/2002  20.26  17.24  22.44  24.34  Medium  2002

[8577 rows x 7 columns]

In [7]:
#5.a
#we grouped using .groupby()[] 'Year' based on 'CLOSE' and with the .mean() method we obtain the average of each year of the variable 'CLOSE'
data.groupby("Year")['CLOSE'].mean()

Year
1990    23.063478
1991    18.373373
1992    15.452047
1993    12.686245
1994    13.925516
1995    12.388770
1996    16.442165
1997    22.363984
1998    25.602976
1999    24.371912
2000    23.315000
2001    25.749677
2002    27.292460
2003    21.982857
2004    15.479644
2005    12.807063
2006    12.810320
2007    17.535936
2008    32.695534
2009    31.479008
2010    22.548889
2011    24.202579
2012    17.801640
2013    14.230119
2014    14.175992
2015    16.674087
2016    15.825635
2017    11.090239
2018    16.639841
2019    15.387540
2020    29.251304
2021    19.656151
2022    25.637148
2023    16.849027
2024    13.790000
Name: CLOSE, dtype: float64

In [8]:
#5.b
#we used .groupby to group the data based on 'Level' then we used .get_group to get the observations with 'Level'='Low'
#and finally we counted them with len(). The argument 'observed=False' is so that it does not show us all the grouped observations
n_Low=len(data.groupby(['Level'], observed=False).get_group('Low'))
print('Days with Low Level:',n_Low)

#days with Medium level
n_Medium=len(data.groupby(['Level'], observed=False).get_group('Medium'))
print('Days with Medium Level:',n_Medium)

#days with High Level
n_High=len(data.groupby(['Level'], observed=False).get_group('High'))
print('Days with High Level:',n_High)

Days with Low Level: 5274
Days with Medium Level: 2582
Days with High Level: 720